#include<stdio.h>
#include<math.h >
int j[10];
main()
{
int a,b,c,d,e,g,i,k,l,m;
long int h,f;
for(a=1;a<10;a++)
   {
	 for(b=0;b<10;b++)
	 {
	  for(c=0;c<10;c++)
	  {
	  for(d=0;d<10;d++)
	 {for(k=0;k<10;k++)
	  {j[k]=0;}//初始化十位数组 
	  j[a]++;j[b]++;j[c]++;j[d]++;//将使用过的的数所在的数组加一 
	  if(j[0]>=2||j[1]>=2||j[2]>=2||j[3]>=2||j[4]>=2||j[5]>=2||j[6]>=2||j[7]>=2||j[8]>=2||j[9]>=2)//如果发生数组大于等于二的，那么就是一个数使用了两遍，所以直接退出循环 
	  continue;
	  else
	  {h=a*1000+b*100+c*10+d;  //组装四位数 
	   f=2*h;                 //乘二算出五位数 
	   if(f>=10000)            //判断f是否是五位数 
	   {m=f;             
	  for(k=0;k<5;k++)           //拆分五位数 
	  {i=pow(10,4-k);            
	   l=m/i;
	   j[l]++;
	   m=m%i;
	  }
	  if(j[0]>=2||j[1]>=2||j[2]>=2||j[3]>=2||j[4]>=2||j[5]>=2||j[6]>=2||j[7]>=2||j[8]>=2||j[9]>=2) //再次查重 
	   continue;
	   else
	   printf("五位数字是%d，四位数字是%d\n",f,h);
	   }
	   else
	   continue;
	 }}}}}}
       
    
      
